{"config": {"layers": [{"config": {"sparse": false, "batch_input_shape": [null, null, null, 3], "dtype": "float32", "name": "input_1"}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"padding": "valid", "kernel_size": [3, 3], "filters": 64, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_regularizer": null, "name": "conv2d_1", "bias_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "class_name": "Conv2D"}, {"config": {"padding": "valid", "kernel_size": [3, 3], "filters": 64, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_regularizer": null, "name": "conv2d_2", "bias_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "conv2d_2", "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "name": "average_pooling2d_1", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "average_pooling2d_1", "class_name": "AveragePooling2D"}, {"config": {"padding": "valid", "kernel_size": [3, 3], "filters": 128, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_regularizer": null, "name": "conv2d_3", "bias_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "name": "conv2d_3", "class_name": "Conv2D"}, {"config": {"padding": "valid", "kernel_size": [3, 3], "filters": 128, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_regularizer": null, "name": "conv2d_4", "bias_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "conv2d_4", "class_name": "Conv2D"}, {"config": {"target_shape": [-1, 128], "trainable": true, "name": "reshape_1"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "reshape_1", "class_name": "Reshape"}, {"config": {"trainable": true, "name": "capsule_1"}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "name": "capsule_1", "class_name": "Capsule"}, {"config": {"function_type": "lambda", "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcyIAAAB0AABqAQB0AABqAgB0AABqAwB8AACDAQBkAQCDAgCD\nAQBTKQJO6QIAAAApBNoBS9oEc3FydNoDc3Vt2gZzcXVhcmUpAdoBeqkAcgcAAAD6DkNOTl9DYXBz\ndWxlLnB52gg8bGFtYmRhPqMAAABzAAAAAA==\n", null, null], "name": "lambda_1", "trainable": true, "output_shape_type": "raw", "output_shape": null, "arguments": {}}, "inbound_nodes": [[["capsule_1", 0, 0, {}]]], "name": "lambda_1", "class_name": "Lambda"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["lambda_1", 0, 0]]}, "keras_version": "2.2.4", "class_name": "Model", "backend": "tensorflow"}