{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"layers": [{"inbound_nodes": [], "name": "input_1", "config": {"name": "input_1", "batch_input_shape": [null, null, null, 3], "sparse": false, "dtype": "float32"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "config": {"bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_1", "trainable": true, "filters": 64, "activation": "relu", "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_2", "trainable": true, "filters": 64, "activation": "relu", "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "average_pooling2d_1", "config": {"name": "average_pooling2d_1", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "class_name": "AveragePooling2D"}, {"inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "name": "conv2d_3", "config": {"bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_3", "trainable": true, "filters": 128, "activation": "relu", "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "conv2d_4", "config": {"bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_4", "trainable": true, "filters": 128, "activation": "relu", "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "reshape_1", "config": {"name": "reshape_1", "trainable": true, "target_shape": [-1, 128]}, "class_name": "Reshape"}, {"inbound_nodes": [[["reshape_1", 0, 0, {}]]], "name": "capsule_1", "config": {"name": "capsule_1", "trainable": true}, "class_name": "Capsule"}, {"inbound_nodes": [[["capsule_1", 0, 0, {}]]], "name": "lambda_1", "config": {"arguments": {}, "name": "lambda_1", "trainable": true, "output_shape_type": "raw", "output_shape": null, "function_type": "lambda", "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcyIAAAB0AABqAQB0AABqAgB0AABqAwB8AACDAQBkAQCDAgCD\nAQBTKQJO6QIAAAApBNoBS9oEc3FydNoDc3Vt2gZzcXVhcmUpAdoBeqkAcgcAAAD6DkNOTl9DYXBz\ndWxlLnB52gg8bGFtYmRhPqMAAABzAAAAAA==\n", null, null]}, "class_name": "Lambda"}], "name": "model_1", "output_layers": [["lambda_1", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "class_name": "Model"}