{"keras_version": "2.2.4", "config": {"layers": [{"config": {"use_bias": true, "batch_input_shape": [null, 32, 32, 3], "name": "conv2d_1", "dtype": "float32", "kernel_constraint": null, "bias_constraint": null, "filters": 32, "padding": "same", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "kernel_constraint": null, "kernel_regularizer": null, "filters": 32, "padding": "valid", "bias_constraint": null, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "activation": "linear", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"padding": "valid", "name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "rate": 0.25, "trainable": true, "noise_shape": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_3", "kernel_constraint": null, "kernel_regularizer": null, "filters": 64, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "activation": "linear", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_4", "kernel_constraint": null, "kernel_regularizer": null, "filters": 64, "padding": "valid", "bias_constraint": null, "bias_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "activation": "linear", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"padding": "valid", "name": "max_pooling2d_2", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "rate": 0.25, "trainable": true, "noise_shape": null, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"use_bias": true, "kernel_constraint": null, "bias_constraint": null, "units": 512, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_1", "activation": "linear", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "class_name": "Activation"}, {"config": {"seed": null, "rate": 0.5, "trainable": true, "noise_shape": null, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"use_bias": true, "kernel_constraint": null, "bias_constraint": null, "units": 10, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_2", "activation": "linear", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_6", "activation": "softmax"}, "class_name": "Activation"}], "name": "sequential_1"}, "class_name": "Sequential", "backend": "tensorflow"}