{"backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"config": {"kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "data_format": "channels_last", "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "batch_input_shape": [null, 32, 32, 3], "trainable": true, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "dtype": "float32", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "data_format": "channels_last", "trainable": true, "padding": "valid", "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "seed": null, "noise_shape": null, "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_3", "data_format": "channels_last", "trainable": true, "padding": "same", "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_4", "data_format": "channels_last", "trainable": true, "padding": "valid", "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "seed": null, "noise_shape": null, "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_1", "trainable": true, "activation": "linear", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 512, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_5", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_3", "seed": null, "noise_shape": null, "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_2", "trainable": true, "activation": "linear", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 10, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_6", "trainable": true}, "class_name": "Activation"}]}, "keras_version": "2.2.4", "class_name": "Sequential"}