{"class_name": "Sequential", "backend": "tensorflow", "config": {"layers": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "batch_input_shape": [null, 28, 28, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "dtype": "float32", "bias_regularizer": null, "name": "conv2d_1", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "activation": "relu", "filters": 32, "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "bias_regularizer": null, "name": "conv2d_2", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "filters": 64, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_1", "rate": 0.25, "trainable": true, "noise_shape": null}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"units": 128, "use_bias": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_2", "rate": 0.5, "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"units": 10, "use_bias": true, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null}}], "name": "sequential_1"}, "keras_version": "2.2.4"}