{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "name": "input_1", "sparse": false}, "name": "input_1", "inbound_nodes": []}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "LSTM", "config": {"name": "lstm_1", "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "use_bias": true, "go_backwards": false, "recurrent_dropout": 0.0, "unit_forget_bias": true, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 1, "bias_regularizer": null, "units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "activity_regularizer": null, "trainable": true, "return_sequences": false, "bias_constraint": null, "return_state": false, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "recurrent_constraint": null, "unroll": false, "dropout": 0.0, "recurrent_regularizer": null}}, "name": "time_distributed_1", "trainable": true}, "name": "time_distributed_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"name": "lstm_2", "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "use_bias": true, "go_backwards": false, "recurrent_dropout": 0.0, "unit_forget_bias": true, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 1, "bias_regularizer": null, "units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "activity_regularizer": null, "trainable": true, "return_sequences": false, "bias_constraint": null, "return_state": false, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "recurrent_constraint": null, "unroll": false, "dropout": 0.0, "recurrent_regularizer": null}, "name": "lstm_2", "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "softmax", "units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "dense_1", "inbound_nodes": [[["lstm_2", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_1", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}