{"backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"config": {"use_bias": true, "dtype": "float32", "bias_regularizer": null, "units": 512, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_1", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 784], "activity_regularizer": null, "activation": "relu", "bias_constraint": null}, "class_name": "Dense"}, {"config": {"rate": 0.2, "name": "dropout_1", "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"use_bias": true, "bias_regularizer": null, "units": 512, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_2", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "relu", "bias_constraint": null}, "class_name": "Dense"}, {"config": {"rate": 0.2, "name": "dropout_2", "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"use_bias": true, "bias_regularizer": null, "units": 10, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_3", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "softmax", "bias_constraint": null}, "class_name": "Dense"}]}, "class_name": "Sequential", "keras_version": "2.2.4"}