{"keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Model", "config": {"input_layers": [["input_2", 0, 0], ["input_3", 0, 0]], "name": "model_2", "layers": [{"config": {"batch_input_shape": [null, 28, 28], "sparse": false, "dtype": "float32", "name": "input_2"}, "name": "input_2", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"batch_input_shape": [null, 28, 28], "sparse": false, "dtype": "float32", "name": "input_3"}, "name": "input_3", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"output_layers": [["dense_3", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 28, 28], "sparse": false, "dtype": "float32", "name": "input_1"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "flatten_1", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 128, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dropout_1", "config": {"rate": 0.1, "seed": null, "trainable": true, "name": "dropout_1", "noise_shape": null}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "dense_2", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 128, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "dense_2", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "dropout_2", "config": {"rate": 0.1, "seed": null, "trainable": true, "name": "dropout_2", "noise_shape": null}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "dense_3", "config": {"activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 128, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "dense_3", "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "activity_regularizer": null}, "class_name": "Dense"}], "name": "model_1"}, "name": "model_1", "inbound_nodes": [[["input_2", 0, 0, {}]], [["input_3", 0, 0, {}]]], "class_name": "Model"}, {"config": {"trainable": true, "name": "lambda_1", "arguments": {}, "output_shape": ["4wEAAAAAAAAAAwAAAAIAAABDAAAAcxoAAAB8AABcAgB9AQB9AgB8AQBkAQAZZAIAZgIAUykDTukA\nAAAA6QEAAACpACkD2gZzaGFwZXPaBnNoYXBlMdoGc2hhcGUycgMAAAByAwAAAPoOU2lhbWVzZV9N\nTFAucHnaFmV1Y2xfZGlzdF9vdXRwdXRfc2hhcGUXAAAAcwQAAAAAAQwB\n", null, null], "function_type": "lambda", "output_shape_type": "lambda", "function": ["4wEAAAAAAAAABAAAAAYAAABDAAAAc1MAAAB8AABcAgB9AQB9AgB0AABqAQB0AABqAgB8AQB8AgAY\ngwEAZAEAZAIAZAMAZAQAgwECfQMAdAAAagMAdAAAagQAfAMAdAAAagUAgwAAgwIAgwEAUykFTtoE\nYXhpc+kBAAAA2ghrZWVwZGltc1QpBtoBS9oDc3Vt2gZzcXVhcmXaBHNxcnTaB21heGltdW3aB2Vw\nc2lsb24pBNoFdmVjdHPaAXjaAXnaCnN1bV9zcXVhcmWpAHIOAAAA+g5TaWFtZXNlX01MUC5wedoS\nZXVjbGlkZWFuX2Rpc3RhbmNlEQAAAHMGAAAAAAEMASgB\n", null, null]}, "name": "lambda_1", "inbound_nodes": [[["model_1", 1, 0, {}], ["model_1", 2, 0, {}]]], "class_name": "Lambda"}], "output_layers": [["lambda_1", 0, 0]]}}