{"keras_version": "2.2.4", "backend": "tensorflow", "config": {"layers": [{"config": {"bias_regularizer": null, "padding": "valid", "batch_input_shape": [null, 32, 32, 3], "name": "conv2d_9", "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "dtype": "float32", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 64, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_13", "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias_regularizer": null, "padding": "valid", "kernel_regularizer": null, "name": "conv2d_10", "use_bias": true, "activity_regularizer": null, "trainable": true, "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 64, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_14", "activation": "relu"}, "class_name": "Activation"}, {"config": {"padding": "valid", "name": "max_pooling2d_5", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"bias_regularizer": null, "padding": "valid", "kernel_regularizer": null, "name": "conv2d_11", "use_bias": true, "activity_regularizer": null, "trainable": true, "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 128, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_15", "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias_regularizer": null, "padding": "valid", "kernel_regularizer": null, "name": "conv2d_12", "use_bias": true, "activity_regularizer": null, "trainable": true, "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 128, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_16", "activation": "relu"}, "class_name": "Activation"}, {"config": {"padding": "valid", "name": "max_pooling2d_6", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_3"}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "name": "dense_7", "use_bias": true, "activity_regularizer": null, "trainable": true, "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 256}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_17", "activation": "relu"}, "class_name": "Activation"}, {"config": {"rate": 0.5, "trainable": true, "name": "dropout_3", "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "name": "dense_8", "use_bias": true, "activity_regularizer": null, "trainable": true, "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 256}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_18", "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "name": "dense_9", "use_bias": true, "activity_regularizer": null, "trainable": true, "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 10}, "class_name": "Dense"}], "name": "sequential_3"}, "class_name": "Sequential"}