{"class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow", "config": {"layers": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "dtype": "float32", "kernel_size": [3, 3], "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 32, 32, 3], "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_1", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "trainable": true, "filters": 32}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_2", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "trainable": true, "filters": 32}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "noise_shape": null, "name": "dropout_1", "seed": null}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_3", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "trainable": true, "filters": 64}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "conv2d_4", "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "trainable": true, "filters": 64}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_2", "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "noise_shape": null, "name": "dropout_2", "seed": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "units": 512}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "noise_shape": null, "name": "dropout_3", "seed": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "units": 10}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_6"}}], "name": "sequential_1"}}