{"backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "batch_input_shape": [null, 32, 32, 3], "kernel_size": [3, 3], "bias_regularizer": null, "filters": 32, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "padding": "same", "name": "conv2d_1", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "filters": 32, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "name": "conv2d_2", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_1", "noise_shape": null, "seed": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "filters": 64, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "name": "conv2d_3", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "filters": 64, "activation": "linear", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "name": "conv2d_4", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_2", "noise_shape": null, "seed": null, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_1", "activation": "linear", "kernel_constraint": null, "units": 512, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_3", "noise_shape": null, "seed": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_2", "activation": "linear", "kernel_constraint": null, "units": 10, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "softmax", "trainable": true}}], "name": "sequential_1"}, "keras_version": "2.2.4"}