{"config": {"name": "sequential_1", "layers": [{"config": {"batch_input_shape": [null, 32, 32, 3], "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "filters": 32, "bias_regularizer": null, "padding": "same", "activation": "linear", "name": "conv2d_1", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 32, "bias_regularizer": null, "name": "conv2d_2", "activation": "linear", "padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "seed": null, "noise_shape": null, "rate": 0.25, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 64, "bias_regularizer": null, "name": "conv2d_3", "activation": "linear", "padding": "same", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 64, "bias_regularizer": null, "name": "conv2d_4", "activation": "linear", "padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "seed": null, "noise_shape": null, "rate": 0.25, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "units": 512, "name": "dense_1", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "class_name": "Activation"}, {"config": {"trainable": true, "seed": null, "noise_shape": null, "rate": 0.5, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "units": 10, "name": "dense_2", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_6"}, "class_name": "Activation"}]}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4"}