{"config": {"layers": [{"config": {"dtype": "float32", "activation": "linear", "bias_constraint": null, "batch_input_shape": [null, 32, 32, 3], "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "name": "conv2d_9", "kernel_regularizer": null, "data_format": "channels_last", "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "activation_13", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"bias_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "name": "conv2d_10", "kernel_regularizer": null, "data_format": "channels_last", "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "activation_14", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_5", "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "name": "conv2d_11", "kernel_regularizer": null, "data_format": "channels_last", "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "activation_15", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"bias_constraint": null, "activation": "linear", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "name": "conv2d_12", "kernel_regularizer": null, "data_format": "channels_last", "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "activation_16", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_6", "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "name": "flatten_3", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "linear", "bias_constraint": null, "activity_regularizer": null, "units": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "name": "dense_7", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_17", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_3", "rate": 0.5, "seed": null, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "linear", "bias_constraint": null, "activity_regularizer": null, "units": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "name": "dense_8", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_18", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "bias_constraint": null, "activity_regularizer": null, "units": 10, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "name": "dense_9", "kernel_regularizer": null}, "class_name": "Dense"}], "name": "sequential_3"}, "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4"}