{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "Conv2D", "config": {"padding": "valid", "filters": 64, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "dilation_rate": [1, 1], "dtype": "float32", "data_format": "channels_last", "activity_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_regularizer": null, "batch_input_shape": [null, 32, 32, 3], "name": "conv2d_1", "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Conv2D", "config": {"padding": "valid", "filters": 64, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "use_bias": true, "name": "conv2d_2", "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"padding": "valid", "filters": 128, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "use_bias": true, "name": "conv2d_3", "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Conv2D", "config": {"padding": "valid", "filters": 128, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "use_bias": true, "name": "conv2d_4", "bias_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "units": 256, "bias_regularizer": null, "use_bias": true, "name": "dense_1", "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "units": 256, "bias_regularizer": null, "use_bias": true, "name": "dense_2", "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "units": 10, "bias_regularizer": null, "use_bias": true, "name": "dense_3", "bias_constraint": null, "kernel_regularizer": null}}], "name": "sequential_1"}}